%列主元高斯消去法 自动化2301 刘安琪
%A、b的定义
A=[1.1348,3.8326,1.1651,3.4017;0.5301,1.7875,2.5330,1.5435;3.4129,4.9317,8.7643,1.3142;1.2371,4.9998,10.6721,0.0147];
b=[9.5342;6.3941;18.4231;16.9237];
tmpA=[];         %定义一个中间量，用于进行行交换
tmpb=[];         %定义一个中间量，用于进行行交换
%选定列主元，并交换行
for k=1:1:3
    max=k;
    for i=k+1:1:4
        if abs(A(i,k))>abs(A(max,k))
            max=i;
        end
    end
    tmpA(1,1:4)=A(k,:);
    A(k,:)=A(max,:);
    A(max,:)=tmpA(1,1:4);
    tmpb(1)=b(k);
    b(k)=b(max);
    b(max)=tmpb(1);
%消元计算
    I=A(k+1:4,k)/A(k,k);
    A(k+1:4,k:4)=A(k+1:4,k:4)-I*A(k,k:4);
    b(k+1:4)=b(k+1:4)-I*b(k);
end
fprintf('列主元高斯消去法消元后的上三角矩阵为：A=\n');
fprintf('%12.5f%12.5f%12.5f%12.5f\n',A(1,:),A(2,:),A(3,:),A(4,:));
fprintf('%12.5f%12.5f%12.5f%12.5f\n',b(1,:),b(2,:),b(3,:),b(4,:));
%回代计算
for j=4:-1:2
    b(j)=b(j)/A(j,j);
    b(1:j-1)=b(1:j-1)-b(j)*A(1:j-1,j);
end
b(1)=b(1)/A(1,1);
fprintf('列主元高斯消去法解得方程组的近似值为：x=\n');
fprintf('%12.5f%12.5f%12.5f%12.5f\n',b(1),b(2),b(3),b(4));